InformationRegisters/ПриложенияКРасчетуНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПриложенияКРасчетуНалогаНаПрибыль</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения3</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение1</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения4</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение3</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения7</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение5</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыПериода</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПриложенияКРасчетуНалогаНаПрибыль/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура НеВычетаемыеРасходыВключаемыеНОБПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура Установитьвидимость()
	Элементы.СтрокаПриложения3.Видимость = Запись.НеВычетаемыеРасходыВключаемыеНОБ;
	Элементы.СтрокаПриложения4.Видимость = Запись.НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода;
	Элементы.СтрокаПриложения7.Видимость = Запись.УменьшениеНОБ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериодаПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура УменьшениеНОБПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры
